railsApp/app/views/users/show.html.erb

SELECT "educations".* FROM "educations" WHERE "educations"."user_id" = $1  [["user_id", 1]]
---
      <div class="educations">
        <% @user.educations.each do |education| %>

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 1]]
---
      <div class="projects">
        <% @user.projects.each do |project| %>

SELECT "experiences".* FROM "experiences" WHERE "experiences"."user_id" = $1  [["user_id", 1]]
---

        <% @user.experiences.each do |experience| %>