railsApp/app/views/projects/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user_id, "User" %>
    <%= form.collection_select :user_id, User.all, :id, :email, prompt: "Select User" %>

SELECT "experiences".* FROM "experiences"
---
  <%= form.label :experience_id, "Experience" %>
  <%= form.collection_select :experience_id, Experience.all, :id, :title, prompt: "Select Experience" %>