railsApp/app/controllers/educations_controller.rb

  def index
    @educations = Education.all
---
SELECT "educations".* FROM "educations"

  def create
    @education = Education.new(education_params)

    if @education.save
---
INSERT INTO "educations" ("title", "description", "user_id", "average_grade", "learned", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @education.update(education_params)
---
UPDATE "educations" SET "updated_at" = $1 WHERE "educations"."id" = $2  [["updated_at", "2024-08-29 15:42:48.842434"], ["id", 1]]

  def destroy
    @education.destroy
---
DELETE FROM "educations" WHERE "educations"."id" = $1  [["id", 1]]

    def set_education
      @education = Education.find(params[:id])
---
SELECT "educations".* FROM "educations" WHERE "educations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]