railsApp/app/controllers/experiences_controller.rb

  def index
    @experiences = Experience.all
---
SELECT "experiences".* FROM "experiences"

  def create
    @experience = Experience.new(experience_params)

    if @experience.save
---
INSERT INTO "experiences" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "fsdf"], ["description", "sfs"], ["user_id", 1], ["created_at", "2024-09-01 06:27:32.733256"], ["updated_at", "2024-09-01 06:27:32.733256"]]

  def update
    if @experience.update(experience_params)
---
UPDATE "experiences" SET "updated_at" = $1 WHERE "experiences"."id" = $2  [["updated_at", "2024-09-01 06:27:32.769994"], ["id", 1]]

    def set_experience
      @experience = Experience.find(params[:id])
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]