railsApp/app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "description", "features", "technologies", "created_at", "updated_at", "user_id", "experience_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "features" = $1, "technologies" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["features", "{\"Lucas Juan Amor\"}"], ["technologies", "{SImon}"], ["updated_at", "2024-08-27 13:36:01.580565"], ["id", 1]]