railsApp/app/controllers/users_controller.rb

UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "[FILTERED]"], ["updated_at", "2024-08-23 11:10:02.383113"], ["id", 1]]
---
    def update
      if @user.update(user_params)