railsApp/app/controllers/users_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 1]]
---
    def show
      @weather_data = fetch_weather_data(params[:latitude], params[:longitude])
      @user = User.find(1)
      @projects = @user.projects.map do |project|