railsApp/app/views/experiences/_form.html.erb

    <%= form.label :user_id, "User" %>
    <%= form.collection_select :user_id, User.all, :id, :email, prompt: "Select User" %>
---
SELECT "users".* FROM "users"