railsApp/app/views/experiences/show.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."experience_id" = $1  [["experience_id", 1]]
---
<ul>
  <% @experience.projects.each do |project| %>