railsApp/app/views/educations/_form.html.erb

SELECT "users".* FROM "users"
---
        <%= form.label :user_id, "User" %>
        <%= form.collection_select :user_id, User.all, :id, :email, prompt: "Select User" %>